In [1]:
import pandas as pd

In [2]:
df_main = pd.read_csv("python-ml-course-master/datasets/athletes/Medals.csv", encoding="ISO-8859-1")

In [3]:
df_main.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6

In [4]:
q_atletas = df_main["Athlete"].unique().tolist()
len(q_atletas)

6956

In [5]:
df_country = pd.read_csv("python-ml-course-master/datasets/athletes/Athelete_Country_Map.csv", encoding="ISO-8859-1")

In [6]:
df_country.head()

            Athlete        Country
0    Michael Phelps  United States
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States

In [7]:
len(df_country)

6970

In [8]:
df_country[df_country["Athlete"] == "Aleksandar Ciric"]

               Athlete                Country
1029  Aleksandar Ciric                 Serbia
1086  Aleksandar Ciric  Serbia and Montenegro

In [9]:
df_sport = pd.read_csv("python-ml-course-master/datasets/athletes/Athelete_Sports_Map.csv", encoding="ISO-8859-1")

In [10]:
df_sport.head()

            Athlete       Sport
0    Michael Phelps    Swimming
1  Natalie Coughlin    Swimming
2     Aleksey Nemov  Gymnastics
3     Alicia Coutts    Swimming
4    Missy Franklin    Swimming

In [11]:
len(df_sport)

6975

In [12]:
df_sport[(df_sport["Athlete"] == "Chen Jing") | (df_sport["Athlete"] == "Richard Thompson") | (df_sport["Athlete"] == "Matt Ryan")]

               Athlete         Sport
528   Richard Thompson     Athletics
1308         Chen Jing    Volleyball
1419         Chen Jing  Table Tennis
2727         Matt Ryan        Rowing
5003         Matt Ryan    Equestrian
5691  Richard Thompson      Baseball

# Merge

In [13]:
df_main_country = pd.merge(
    left= df_main,
    right=df_country,
    left_on="Athlete",
    right_on="Athlete"
)

In [14]:
df_main_country.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States

In [15]:
df_main_country.shape

(8657, 9)

In [16]:
df_main.shape

(8618, 8)

In [17]:
df_main_country[df_main_country["Athlete"] == "Aleksandar Ciric"]

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
1503,Aleksandar Ciric,30.0,2008,08/24/2008,0,0,1,1,Serbia
1504,Aleksandar Ciric,30.0,2008,08/24/2008,0,0,1,1,Serbia and Montenegro
1505,Aleksandar Ciric,26.0,2004,08/29/2004,0,1,0,1,Serbia
1506,Aleksandar Ciric,26.0,2004,08/29/2004,0,1,0,1,Serbia and Montenegro
1507,Aleksandar Ciric,22.0,2000,10/01/2000,0,0,1,1,Serbia
1508,Aleksandar Ciric,22.0,2000,10/01/2000,0,0,1,1,Serbia and Montenegro

In [18]:
df_country_dp = df_country.drop_duplicates(subset="Athlete")

In [20]:
df_country_dp[df_country_dp["Athlete"] == "Aleksandar Ciric"]

               Athlete Country
1029  Aleksandar Ciric  Serbia

In [21]:
df_country[df_country["Athlete"] == "Aleksandar Ciric"]

               Athlete                Country
1029  Aleksandar Ciric                 Serbia
1086  Aleksandar Ciric  Serbia and Montenegro

In [22]:
df_main_country = pd.merge(
    left= df_main,
    right=df_country_dp,
    left_on="Athlete",
    right_on="Athlete"
)

In [23]:
df_main_country[df_main_country["Athlete"] == "Aleksandar Ciric"]

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
1491,Aleksandar Ciric,30.0,2008,08/24/2008,0,0,1,1,Serbia
1492,Aleksandar Ciric,26.0,2004,08/29/2004,0,1,0,1,Serbia
1493,Aleksandar Ciric,22.0,2000,10/01/2000,0,0,1,1,Serbia

In [24]:
df_main.shape

(8618, 8)

In [25]:
df_main_country.shape

(8618, 9)

In [26]:
df_sport_sp = df_sport.drop_duplicates(subset="Athlete")

In [27]:
df_sport_sp.shape

(6956, 2)

In [28]:
df_final = pd.merge(
    left=df_main_country,
    right=df_sport_sp,
    left_on="Athlete",
    right_on="Athlete"
)

In [29]:
df_final.shape

(8618, 10)

In [30]:
df_final.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country,Sport
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States,Swimming
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States,Swimming
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States,Swimming
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States,Swimming
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States,Swimming